app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1 AND "todos"."id" = $2 LIMIT $3  [["project_id", 10], ["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "id" = $1, "title" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["id", 1], ["title", "ds"], ["updated_at", "2020-08-14 10:39:22.717226"], ["id", 2]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", false], ["updated_at", "2020-08-11 10:51:51.151816"], ["id", 1]]
---
  def update
    @Todo = @Project.todos.find(params[:id])
    @Todo[:isCompleted] = !@Todo[:isCompleted]
    if @Todo.save

INSERT INTO "projects" ("id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1], ["title", "может быddsть повезло"], ["created_at", "2020-08-14 11:22:15.369394"], ["updated_at", "2020-08-14 11:22:15.369394"]]
UPDATE "projects" SET "id" = $1, "title" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["id", 1], ["title", "может быddsть повезло"], ["updated_at", "2020-08-14 11:22:50.780055"], ["id", 5]]
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "new"], ["created_at", "2020-08-11 11:14:24.563311"], ["updated_at", "2020-08-11 11:14:24.563311"]]
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "testapi"], ["project_id", 10], ["created_at", "2020-08-11 11:01:15.480527"], ["updated_at", "2020-08-11 11:01:15.480527"]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", false], ["updated_at", "2020-08-11 11:17:27.174240"], ["id", 8]]
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "testapi1"], ["project_id", 11], ["created_at", "2020-08-11 11:14:24.587593"], ["updated_at", "2020-08-11 11:14:24.587593"]]
---
  def create
    if(params[:project_id] == 0)
      @Project = Project.create(project_params)
      if @Project.save
        render @Project
      else
        render json: {message: 'error create project'}
      end

    else
      set_project
    end

    @Todo = @Project.todos.create(todo_params)
    if @Todo.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def set_project
    @Project = Project.find(params[:project_id])