app/controllers/todos_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @Project = Project.find(params[:project_id])
    @Todo = @Project.todos.find(params[:id])

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 11]]
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "fds"], ["project_id", 5], ["created_at", "2020-08-14 10:37:52.448795"], ["updated_at", "2020-08-14 10:37:52.448795"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def create
    prod = {project: { title: project_params[:title],
                      todos_attributes: [ {text: todo_params[:text], isCompleted: false } ] } }
    unless params[:project_id]
      Project.create(prod[:project])
    else
      @Todo = Project.find(params[:project_id]).todos.create(prod[:project][:todos_attributes]);